{
    "data": {
        "credit_score": {
            "01_type": "Education object",
            "02_id": "60106cb9411688f1f33d2e3d",
            "03_attributes": {
                "A_order": 2,
                "B_classification": "Credit Score",
                "C_question": "What is your current credit score?",
                "D_description": " A high score will give you access to lower interest rates and more lender choices. If you have a low score, you may have trouble getting a loan.",
                "E_information": "Your credit score plays a big role in the interest rate you’ll get for your loan.",
                "F_note": "Your credit score is a numerical rating that ranges from 300 – 850 and tells lenders how responsible you are when you borrow money. ",
                "G_source": "https://www.rocketmortgage.com",
                "H_symbol": ""
            }
        },
        "downpayment_percentage": {
            "01_type": "Education object",
            "02_id": "60106ce1411688f1f33d2e42",
            "03_attributes": {
                "A_order": 7,
                "B_classification": "Downpayment Percentage",
                "C_question": "What downpayment percentage are you aiming to save?",
                "D_description": "Your down payment is the amount of money you put down on your mortgage. Your down payment is due during closing and is usually the most expensive closing cost you need to plan for.",
                "E_information": "You might have heard you need 20% down to buy a home. The reason why this number is often quoted is that 20% down is the minimum you’ll need to avoid buying private mortgage insurance – it’s not the minimum you need to get a loan.",
                "F_note": "You can buy a home with as little as 3% down.",
                "G_source": "https://www.rocketmortgage.com",
                "H_symbol": "%"
            }
        },
        "downpayment_savings": {
            "01_type": "Education object",
            "02_id": "60106cd6411688f1f33d2e40",
            "03_attributes": {
                "A_order": 5,
                "B_classification": "Downpayment Savings",
                "C_question": "Do you have any savings set aside for your downpayment?",
                "D_description": "Your down payment plays a big part in your affordability. The more you put down, the lower your monthly payment will be.",
                "E_information": "That money typically comes from your personal savings, and in most cases, you pay with a check, a credit card, or an electronic payment.",
                "F_note": "Homeownership comes with costs that rentals do not. So remember to put extra money away for closing costs, maintenance, and home repairs.",
                "G_source": "http://www.trulia.com",
                "H_symbol": "$"
            }
        },
        "goal_home_price": {
            "01_type": "Education object",
            "02_id": "60106ce7411688f1f33d2e43",
            "03_attributes": {
                "A_order": 8,
                "B_classification": "Goal Home Price",
                "C_question": "What is the price of your ideal home?",
                "D_description": "This is the home value of a property you are interested in. If you don't have a goal principal, that's okay - we can calculate a potential principal based off your rent",
                "E_information": "",
                "F_note": "The pragmatic report gives your monthly payment you would make with your goal price.",
                "G_source": "",
                "H_symbol": "$"
            }
        },
        "monthly_debt": {
            "01_type": "Education object",
            "02_id": "60106ccf411688f1f33d2e3f",
            "03_attributes": {
                "A_order": 4,
                "B_classification": "Monthly Debt",
                "C_question": "What would you say your monthly debt is?",
                "D_description": "What to include: minimum credit card payment, auto, student, or personal loan payments, alimony or child support. Do not include: current rent or monthly utilities, groceries, and other costs of living.",
                "E_information": "This is NOT your DTI aka Debt-To-Income Ratio, Your DTI is equal to your total fixed, recurring monthly debts divided by your total monthly gross household income.",
                "F_note": "Your debts directly affect your affordability, since it’s based on the ratio between what you earn (income) and what you owe (debts).",
                "G_source": "http://www.trulia.com",
                "H_symbol": "$"
            }
        },
        "monthly_salary": {
            "01_type": "Education object",
            "02_id": "60106cc6411688f1f33d2e3e",
            "03_attributes": {
                "A_order": 3,
                "B_classification": "Monthly Salary",
                "C_question": "What is your net monthly salary?",
                "D_description": "Gross income is the total amount you earn (typically over the course of a year) before expenses. Net income is the profit your business earns after expenses.",
                "E_information": "Depending on the home price you’re aiming for, you may want to wait a year or two before you apply for a mortgage if you’ve just moved into a higher-paying role. The longer you stay in your higher-paying position, the more your lender may be willing to loan you.",
                "F_note": "The amount of money you earn plays a smaller role in getting a mortgage than you might think. ",
                "G_source": "https://www.rocketmortgage.com",
                "H_symbol": "$"
            }
        },
        "mortgage_term": {
            "01_type": "Education object",
            "02_id": "60106cdc411688f1f33d2e41",
            "03_attributes": {
                "A_order": 6,
                "B_classification": "Mortgage Term",
                "C_question": "What mortgage term are you aiming for?",
                "D_description": "Your mortgage term is the number of years you’ll pay on your loan before you fully own your home. ",
                "E_information": "A mortgage is a classification of loan that uses your home as collateral. It’s typically used to buy a home or in refinance situations to secure a more favorable deal and possibly convert equity in your home to cash.",
                "F_note": "Typically, a fixed-rate mortgage runs 30 years and this is the number we will use if you want us to.",
                "G_source": "https://www.rocketmortgage.com/",
                "H_symbol": ""
            }
        },
        "rent": {
            "01_type": "Education object",
            "02_id": "60106cee411688f1f33d2e44",
            "03_attributes": {
                "A_order": 9,
                "B_classification": "Rent",
                "C_question": "What is your current monthly rent?",
                "D_description": "We will use your rent to calculate a principal by using rent as the Monthly Principal amount in the mortgage calculator",
                "E_information": "",
                "F_note": "The imaginative report gives a total home price you can afford based off of your monthly rent.",
                "G_source": "",
                "H_symbol": "$"
            }
        },
        "zip_code": {
            "01_type": "Education object",
            "02_id": "60106caa411688f1f33d2e3c",
            "03_attributes": {
                "A_order": 1,
                "B_classification": "ZIP Code",
                "C_question": "What is the zipcode you'd like to live in?",
                "D_description": "Property taxes and interest rates can vary by location. Enter the ZIP code where you're looking for homes and we'll automatically add property taxes and interest rates for your area.",
                "E_information": "A “cost of living analysis” by two large realty companies discovered that living in the suburbs versus living in the city does impact your cost of living – by thousands of dollars. ",
                "F_note": "The term ZIP is an acronym for Zone Improvement Plan",
                "G_source": "http://www.trulia.com/",
                "H_symbol": ""
            }
        }
    }
}
